erp3l/src/Catalogs/Сценарии/Сценарии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сценарии</name>
  <comment>(-УХМодульОбъекта)(-УХМодульМенеджера)(-УХПредопределенные)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ИсполнениеБюджета</name>
      <description>Исполнение бюджета</description>
    </items>
    <items>
      <name>План</name>
      <description>План для лимитов</description>
    </items>
    <items>
      <name>Резерв</name>
      <description>Резерв</description>
    </items>
    <items>
      <name>Факт</name>
      <description>Факт</description>
    </items>
    <items>
      <name>ФактическиеДанные</name>
      <description>Фактические данные</description>
    </items>
  </predefined>
  <attributes>
    <name>Валюта</name>
    <comment>(-ЕРППроверкаЗаполнения)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКурсыДругогоСценария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийКурсов</name>
    <comment>(-ЕРППроверкаЗаполнения)</comment>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребоватьУказанияКурсовДляКаждогоПериода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийДляАктуализации</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеРаспределениеВГО</name>
    <comment>Автоматическое изменение симметричных показателей ВГО</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураДанныхОбновлена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьЦикла</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойСценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </attributes>
  <attributes>
    <name>СценарийРаспределения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкользящееПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимПланирования</name>
    <type>
      <types>EnumRef.РежимыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяВалютаКурсов</name>
    <comment>(-ЕРППроверкаЗаполнения)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПериодыРегламентов</name>
    <attributes>
      <name>Регламент</name>
      <type>
        <types>CatalogRef.ВерсииРегламентовПодготовкиОтчетности</types>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.Периодичность</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСвойства</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СвойстваОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>Characteristic.СвойстваОбъектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/Сценарии/Forms/ФормаГруппы/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И ЗначениеЗаполнено(Объект.Родитель) Тогда	
		Объект.ПериодыРегламентов.Загрузить(Объект.Родитель.ПериодыРегламентов.Выгрузить());	
		Объект.РежимПланирования 			= Объект.Родитель.РежимПланирования;
		Объект.СценарийДляАктуализации 		= Объект.Родитель.СценарийДляАктуализации;
		Объект.СценарийРаспределения 		= Объект.Родитель.СценарийРаспределения;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда	
		Объект.РежимПланирования = Перечисления.РежимыПланирования.ПланированиеНаИнтервал;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПериодичностьРегламента(Регламент)
	
	Периодичность = перечисления.Периодичность.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Регламент)  Тогда
		
		 Периодичность =  Регламент.Периодичность;
		
	КонецЕсли;	

	Возврат Периодичность;
	
КонецФункции

&НаКлиенте
Процедура ПериодыРегламентовРегламентПриИзменении(Элемент)
	
	Элементы.ПериодыРегламентов.ТекущиеДанные.Периодичность = ПолучитьПериодичностьРегламента(Элементы.ПериодыРегламентов.ТекущиеДанные.Регламент)
	
КонецПроцедуры
